[
  {
    "id": 1,
    "name": "Pritesh Bhosale",
    "rating": 5,
    "text": "Outstanding Laparoscopic Hernia Repair Experience for My Father Recently underwent laparoscopic hernia repair surgery, and I am incredibly grateful to Dr. pramod Kadan and the entire medical team for their exceptional care. From the very first consultation, Dr. Sheetal and Dr Pramod Kadam took the time to clearly explain the procedure, answer all my questions, and ensure I felt completely comfortable and informed. The surgery itself was smooth and expertly handled. Thanks to Dr. Pramod Kadam precision, I highly recommend Dr. Pramod Kadam to anyone considering laparoscopic hernia repair. You will be in excellent hands!"
  },
  {
    "id": 2,
    "name": "Vaishali Ingle",
    "rating": 5,
    "text": "I am truly grateful to Dr. Kadam for the excellent care and support throughout my surgery. From consultation to recovery, everything was managed with great professionalism and compassion. The procedure went smoothly, and the recovery was much easier with his clear guidance and reassurance. I sincerely appreciate his expertise and dedication, and I would highly recommend Dr. Kadam to anyone in need of surgical care."
  },
  {
    "id": 3,
    "name": "Vijay Yadav",
    "rating": 5,
    "text": "I recently visited Dr. Pramod Kadam for the treatment of an abscess, and I couldn't be happier with the entire experience. From the initial consultation to the surgery and post-surgery care, everything was handled with the highest level of professionalism and care. The doctor explained the procedure clearly, made me feel comfortable, and ensured I understood every step. The surgery was done skillfully, and the recovery process was smooth thanks to the proper guidance and follow-up. I truly appreciate the doctor's expertise, patience, and compassionate approach. I highly recommend Dr. Pramod Kadam to anyone looking for excellent medical care."
  },
  {
    "id": 4,
    "name": "Mohit Goyal",
    "rating": 5,
    "text": "Dr. Pramod Kadam in Pune was outstanding for my wife's gallbladder surgery. His expertise, clear communication, and compassionate care made the process smooth and stress-free. The laparoscopic surgery was precise, resulting in minimal scarring and a quick recovery. Highly recommend Dr. Kadam for his exceptional skill and dedication!"
  },
  {
    "id": 5,
    "name": "Atharv Chawle",
    "rating": 5,
    "text": "Dr. Pramod Kadam performed my appendix surgery, who is a great surgeon and consultant. Dr. Pramod Kadam is also one of the exceptional surgeons I have ever seen. He made me feel comfortable before the surgery and encouraged me for a smooth surgical procedure. Thank you very much to Dr. Pramod Kadam and his team for your exceptional support and care."
  },
  {
    "id": 6,
    "name": "Priya Kashyap",
    "rating": 5,
    "text": "I recently underwent gall bladder surgery performed by Dr. Pramod Kadam, and I couldn't have asked for a better experience. He is calm, confident, and extremely skilled. The entire process was smooth, and I felt well taken care of from start to finish. His post-operative guidance was also clear and reassuring. Truly grateful for his care and would totally recommend him to anyone looking for a trustworthy and experienced surgeon."
  },
  {
    "id": 7,
    "name": "Sharadakanta Dash",
    "rating": 5,
    "text": "Recently I visited K Care Clinic and consulted Dr Pramod Kadam. He suggested the surgery and we did it in so ease. The post surgery recovery was fast under his supervision. There is no second opinion required if you are consulting Dr Kadam. He is so attention to details and explains everything so clearly. And yes he is so down to earth and treat his patients well. Thanks for everything! Dr Kadam is highly recommended for surgery."
  },
  {
    "id": 8,
    "name": "Smita Bawake",
    "rating": 5,
    "text": "Thanks a lot Dr. Pramod Kadam for the successful surgery you performed for my mother. The whole process was so smooth, and the operation was quick and handled with great expertise. Before coming to you, we had a very stressful experience—our previous doctor refused to do the operation because of complications like high blood sugar (diabetes) and BP, and he didn't provide us with proper guidance or reassurance. At that time, our whole family was very tensed and worried. But when we came to you, everything changed. You explained things clearly, gave us confidence, and carried out the surgery with such care and professionalism that our stress was finally lifted. Seeing my mother safe and recovering well is a huge relief for us, and we are truly grateful to you. Thank you once again, not only for the successful surgery, but also for giving us peace of mind during such a difficult time. We will always remember your support and kindness"
  },
  {
    "id": 9,
    "name": "Heena Parashar",
    "rating": 5,
    "text": "Words and ratings fall short when it comes to Dr. Pramod Sir. I had been suffering from endometriosis for the last 10.5 years, and unfortunately, it went unidentified despite consulting multiple doctors. I was constantly moving from one specialist to another, but never received a proper diagnosis or relief. However, when I met Dr. Pramod Sir at Kare Clinic, everything changed. He was the one who correctly identified my condition — without recommending any unnecessary tests or medications. My entire journey, from surgery to post-operative care, was incredibly smooth under his guidance. He is a very good listener, understands the patient's concerns thoroughly, and is always approachable. I highly recommend Dr. Pramod Sir, to anyone looking for genuine and effective care."
  },
  {
    "id": 10,
    "name": "Christopher Pavey",
    "rating": 5,
    "text": "I was suggested to go for Gall Bladder Removal surgery (Cholecystectomy) to Doctor Pramod Kadam. My experience has been excellent. Doctor Pramod Kadam is an excellent surgeon with magical fingers at surgery. Doctor Pramod is very understanding, loving and caring, by nature he is very helpful and patient friendly, he gave his phone number and would respond to all the queries. I recommend Pramod Kadam to everyone who needs surgery. Doctor Pramod did laparoscopic gallbladder surgery for me and now after 3 days I am feeling fit with enough energy to manage my routine tasks. Thanks to his expertise in the field. He is approachable inspite of a very busy schedule and I would highly recommend Dr. Pramod Kadam to anyone who requires laparoscopic surgery. Thank you Doctor Pramod Kadam."
  },
  {
    "id": 11,
    "name": "K Singh",
    "rating": 5,
    "text": "Dr. Pramod Kadam is an outstanding Doctor in surgery, his approach regarding Surgery was excellent, his team are Super caring and Executing the related activities so smoothly. I am so happy about your caring services. In his team Dr SAROJA AND Dr SAYALI services are very very excellent. Thank you Dr Pramod Kadam, thanks a lot."
  },
  {
    "id": 12,
    "name": "Vinod Shelar",
    "rating": 5,
    "text": "I had a great experience at this clinic. The doctor is very knowledgeable, kind, and professional. The treatment I received was effective and the results were better than I expected. The staff is also very helpful and polite. The clinic is clean, well-maintained, and has a very comfortable environment. I truly appreciate the care and attention I received here. Highly recommended for anyone looking for quality medical treatment!"
  },
  {
    "id": 13,
    "name": "Puja Jain",
    "rating": 5,
    "text": "I had a great experience at K Care Clinic. The doctor gave a very positive and reassuring response right from the first consultation. He explained everything clearly and made me feel comfortable throughout the treatment. Highly recommend for anyone in the Charholi or Dhanora area!"
  },
  {
    "id": 14,
    "name": "Sushant Raut",
    "rating": 5,
    "text": "Dear Dr. Pramod Kadam Sir, Thank you sincerely for all your support during a very difficult time for us. It was an overwhelming and painful experience when I suddenly developed severe pain one morning due to sugar imbalance and acidity. The discomfort was unbearable. Following our physician's advice, we went ahead with a sonography, which revealed an issue with the gallbladder. When we shared the report with you over WhatsApp, you responded within minutes and advised immediate admission, identifying the urgency of the situation. We are especially grateful for your prompt follow-up to ensure we had reached the hospital, and for your guidance on the procedure—even on a Saturday night. Your support during our most stressful moments, including helping us with the admission process, meant a lot to us. You patiently explained both the robotic and laparoscopic surgery options in detail, and despite it being a holiday, you decided to go ahead with the surgery on Sunday, prioritizing my well-being above all else. I'm now feeling much better and more relaxed. Thank you once again for your constant care, kindness, and dedication."
  },
  {
    "id": 15,
    "name": "Rahul Pawar",
    "rating": 5,
    "text": "Dr. Pramod Kadam did lipoma surgery for me, He is excellent surgeon and all the support staff was really good. they helped in pre surgery with right medication and post surgery too. This helped in speedy recovery after the surgery and i was back to day to day task in couple of days. Even the surgical stitches were done professionally which resulted in less visible scare. Thanks a lot !!!"
  },
  {
    "id": 16,
    "name": "Nunsavath Kishan",
    "rating": 5,
    "text": "I recently had an appointment with Dr. Pramod Kadam and had a very positive experience. He is an understanding and patient doctor who took the time to listen to my concerns and provided reassurance about the treatment and recovery process. His expertise and skill as a surgeon are truly commendable. Additionally, his clinic is well-maintained and hygienic, ensuring a comfortable and professional environment for patients."
  },
  {
    "id": 17,
    "name": "R M",
    "rating": 5,
    "text": "I had an excellent experience with Dr. Pramod Kadam. He was not only highly knowledgeable and professional but also took the time to listen to my concerns and thoroughly explain the Surgery plan. His compassionate and caring approach made me feel at ease throughout the process. I sincerely appreciate his dedication to patient care and would highly recommend him to anyone seeking exceptional medical expertise."
  },
  {
    "id": 18,
    "name": "Dilip Joshi",
    "rating": 5,
    "text": "Thanks to Dr Pramod. I was operated by him for Robotic Hernia Surgery. I am happy with Pre operation Consultation Operation and Post operation further advice of Dos and Don'ts. Thanks once again to Dr. Pramod."
  },
  {
    "id": 19,
    "name": "Suraj Biramane",
    "rating": 5,
    "text": "I underwent laparoscopic appendectomy by Dr. Pramod Kadam who is a great surgeon and consultant. Dr. Pramod Kadam is also an exceptional surgeon I have ever seen. He made me feel comfortable before surgery and encouraged about the smooth process of surgery. I am grateful to get better care at K Care Clinic Dhanori. Thank you very much Dr. Pramod Kadam and team for your exceptional support and care."
  },
  {
    "id": 20,
    "name": "Rishabh Jain",
    "rating": 5,
    "text": "Thankful to dr pramod kadam,he is very friendly and 24*7 available, thanks and better prefer dr pramod kadam for medical emergency and for surgery"
  },
  {
    "id": 21,
    "name": "Kushal Jadhav",
    "rating": 5,
    "text": "Dr. Kadam is highly experienced Surgeon and his treatment is very precise and helpful. Although his schedule is extremely tight, you can be assured that he will give you appropriate consultation. Entire team at K care is extremely well managed. The quality of the clinic is best in this area. Highly recommended for people who need best advice and treatment."
  },
  {
    "id": 22,
    "name": "Kiran Kulkarni",
    "rating": 5,
    "text": "Dr. Pramod Kadam is a surgeon of par excellence. He is not only a great doctor but also a kind human being. I have consulted him at multiple occasions, but would like to highlight two instances where he provided excellent treatment. First one was for my 5 yr old daughter, who had an umbilical hernia by birth. He took exceptional care of her, so much so that she was discharged on 5th day and she could expeditiously regain her naughty activities!! Next one was when we approached him for my father-in-law's hernia surgery, which was operated on previously by a surgeon from Hyderabad and it was not successful (recurring). Dr. Kadam could expertly figure out the factors that had gone wrong with the previous surgery and provided an excellent remedial treatment. With my background in the field of medicine, I can certainly say that Dr. Pramod Kadam is an exceptionally brilliant surgeon and I strongly recommend him for consultation for problems related to any type of surgery, particularly for hernia and piles."
  },
  {
    "id": 23,
    "name": "Shruti Ringe",
    "rating": 5,
    "text": "I recently underwent gall bladder surgery performed by Dr. Pramod Kadam, and I must say it was an excellent experience. Dr. Kadam is highly skilled, professional, and empathetic, making me feel completely at ease throughout the process. The surgery was smooth, and the recovery has been quick, thanks to his expert care and guidance."
  },
  {
    "id": 24,
    "name": "Dixitha Kularia",
    "rating": 5,
    "text": "I was hospitalised for severe stomach pain two months back and other doctor and specialist couldn't detect my issue for pain, recently I had again suffered the same abdominal pain and I had appendicitis infection and my hospital had suggested their panel doctors-Pramod Kadam-he insisted upon surgery and before surgery i was very nervous-doctor Kadam had spoken and made me calm, the experience of my surgery and post surgery with him was very very good, he is a very good experienced doctor and really good with his work. I would really really recommend anyone who wants to get laparoscopic surgery done, pls go to him. Also he is a doctor whom one can approach and he never misses to reply with a ease with his busy schedules. Thank you doctor for the best service and experience with you"
  },
  {
    "id": 25,
    "name": "C.P Vinod",
    "rating": 5,
    "text": "I am very thankful to Dr Pramod Kadam and his team of doctors for the surgery I underwent at Ruby Hall. I am also pleased with the outcome of my surgery. Dr Kadam is a down to earth person and answered all my queries and was very supportive. I'd like to thank Dr Kadam for the excellent care and treatment I received. The medical services I received from you during my stay in the hospital was exceptional. Thanks also to all your wonderful staff members including the nursing staff for their patience and support during my hospitalization."
  },
  {
    "id": 26,
    "name": "Anand Gurnani",
    "rating": 5,
    "text": "I recently underwent treatment under the exceptional care of Dr. Pramod Kadam and his skilled team, including Dr. Saroja, at Ruby Hall Clinic on Sasoon Road. My experience was remarkable from start to finish. What sets Dr. Pramod apart is his unwavering dedication and extraordinary accessibility. Despite his incredibly busy schedule performing surgeries and attending to patients, he made time to meet me for a consultation at 10:30 PM on Christmas night. Following his recommendations, I completed the necessary tests the next day and was admitted for gallbladder removal surgery on December 27th. The entire process was seamless – from the initial consultation through the pre-surgical preparations, the operation itself, and my recovery period both at Ruby Hall and at home. Dr. Pramod and his team, along with the compassionate hospital staff, managed every aspect with utmost professionalism. My recovery progressed steadily, exactly as he had outlined. What truly distinguishes Dr. Pramod is his personal investment in each patient's care. He not only takes complete responsibility for their treatment but also infuses his natural enthusiasm and positive energy into their recovery journey, motivating them to actively participate in their healing process. Dr. Pramod carries his remarkable healing experience and aura with a swagger and his unique style, that definitely helped boost my confidence in him for doing my surgery."
  },
  {
    "id": 27,
    "name": "Niraj Singh",
    "rating": 5,
    "text": "Dr. Pramod Kadam Sir is a very knowledgeable, kind and helpful person. I am comparing him as a God for me. He has operated my gallbladder operation in December 28, 2024. My operation was successful and I am feeling well. Dr. Pramod Sir and his team of Doctors all are very kind and helpful and knowledgeable person."
  },
  {
    "id": 28,
    "name": "Sumana Sarkar",
    "rating": 5,
    "text": "The way you explained us the exact line of treatment effectively was very helpful. Your kindness, empathy towards us was really great. Thank you for your support"
  },
  {
    "id": 29,
    "name": "Reaz Shaikh",
    "rating": 5,
    "text": "I recently went through a minor surgery. I am extremely satisfied with the treatment and care provided by Dr Pramod Kadam. I am very grateful to DR Kadam and his entire team to make this treatment and surgery very smooth and painless. He is very good and experienced Dr in his field of treatment. He is always responsive to all your queries through call and WhatsApp. Thankyou once again Sir."
  },
  {
    "id": 30,
    "name": "Shashikant Bhargava",
    "rating": 5,
    "text": "Knowledge and dedication - Dr. Pramod kadam is the only surgeon that I trust. His knowledge and dedication to patient care is unmatched. Kindness and professionalism - The doctor was very pleasant and professional. He was very calm, very clear and confident. Explanations - The doctor listened and then explained certain things about surgery which was reassuring. He took time to listen to my symptoms in great detail and was extremely helpful in explaining any medical terms I did not understand. Availability - He was always available on call. Calls are always answered, and appointments are scheduled in such a manner that there is never a wait!"
  }
]